In [20]:
# !pip install pandas

In [21]:
# !pip install numpy

In [22]:
import pandas as pd
import numpy as np

In [23]:
# Pandas is a library to work Series and DataFrame
# Series :- One Dimensional Data 1D List,Array,Tuple
# DataFrame :- 2D Dataset (in the tabular format (rows/cols))

In [24]:
# Pandas is use to manipulate, Transform and clean the data

In [25]:
data = {
    'EmpID':[101,102,103,104,105,106,107,108,109,110],
    'EmpName':['Raj','Anu','Manu','Siya','Aman','Ram','Shyam','Mohan','Ravi','Yogesh'],
    'EmpSalary':[23440,67440,45340,78756,34550,56650,32450,78970,44500,38300],
    'EmpAdd':['Noida','Delhi','GZB','Noida','Noida','Delhi','GZB','Noida','Noida','Delhi']
}

In [26]:
df = pd.DataFrame(data)

In [27]:
df

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj      23440  Noida
1    102     Anu      67440  Delhi
2    103    Manu      45340    GZB
3    104    Siya      78756  Noida
4    105    Aman      34550  Noida
5    106     Ram      56650  Delhi
6    107   Shyam      32450    GZB
7    108   Mohan      78970  Noida
8    109    Ravi      44500  Noida
9    110  Yogesh      38300  Delhi

In [28]:
df.head()

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj      23440  Noida
1    102     Anu      67440  Delhi
2    103    Manu      45340    GZB
3    104    Siya      78756  Noida
4    105    Aman      34550  Noida

In [29]:
df.head(3)

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj      23440  Noida
1    102     Anu      67440  Delhi
2    103    Manu      45340    GZB

In [30]:
df.tail()

   EmpID EmpName  EmpSalary EmpAdd
5    106     Ram      56650  Delhi
6    107   Shyam      32450    GZB
7    108   Mohan      78970  Noida
8    109    Ravi      44500  Noida
9    110  Yogesh      38300  Delhi

In [31]:
df.tail(2)

   EmpID EmpName  EmpSalary EmpAdd
8    109    Ravi      44500  Noida
9    110  Yogesh      38300  Delhi

In [32]:
df.shape

(10, 4)

In [33]:
print("Rows :",df.shape[0])
print("Cols :",df.shape[1])

Rows : 10
Cols : 4

In [34]:
df.columns

Index(['EmpID', 'EmpName', 'EmpSalary', 'EmpAdd'], dtype='object')

In [35]:
df.EmpName

0       Raj
1       Anu
2      Manu
3      Siya
4      Aman
5       Ram
6     Shyam
7     Mohan
8      Ravi
9    Yogesh
Name: EmpName, dtype: object

In [36]:
df['EmpName']

0       Raj
1       Anu
2      Manu
3      Siya
4      Aman
5       Ram
6     Shyam
7     Mohan
8      Ravi
9    Yogesh
Name: EmpName, dtype: object

In [38]:
df[['EmpName','EmpSalary']]

  EmpName  EmpSalary
0     Raj      23440
1     Anu      67440
2    Manu      45340
3    Siya      78756
4    Aman      34550
5     Ram      56650
6   Shyam      32450
7   Mohan      78970
8    Ravi      44500
9  Yogesh      38300

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   EmpID      10 non-null     int64
 1   EmpName    10 non-null     object
 2   EmpSalary  10 non-null     int64
 3   EmpAdd     10 non-null     object
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [40]:
df.describe()

           EmpID     EmpSalary
count   10.00000     10.000000
mean   105.50000  50039.600000
std      3.02765  19594.565727
min    101.00000  23440.000000
25%    103.25000  35487.500000
50%    105.50000  44920.000000
75%    107.75000  64742.500000
max    110.00000  78970.000000

In [43]:
data = {
    'EmpID':[101,102,103,104,105,106,107,108,109,110],
    'EmpName':['Raj','Anu','Manu','Siya',np.nan,'Ram','Shyam','Mohan','Ravi','Yogesh'],
    'EmpSalary':[23440,67440,np.nan,78756,34550,56650,32450,78970,np.nan,38300],
    'EmpAdd':['Noida','Delhi','GZB',np.nan,'Noida','Delhi',np.nan,np.nan,'Noida','Delhi']
}

In [44]:
df = pd.DataFrame(data)

In [45]:
df

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj    23440.0  Noida
1    102     Anu    67440.0  Delhi
2    103    Manu        NaN    GZB
3    104    Siya    78756.0    NaN
4    105     NaN    34550.0  Noida
5    106     Ram    56650.0  Delhi
6    107   Shyam    32450.0    NaN
7    108   Mohan    78970.0    NaN
8    109    Ravi        NaN  Noida
9    110  Yogesh    38300.0  Delhi

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   EmpID      10 non-null     int64
 1   EmpName    9 non-null      object
 2   EmpSalary  8 non-null      float64
 3   EmpAdd     7 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

In [47]:
df.isnull()

   EmpID  EmpName  EmpSalary  EmpAdd
0  False    False      False   False
1  False    False      False   False
2  False    False       True   False
3  False    False      False    True
4  False     True      False   False
5  False    False      False   False
6  False    False      False    True
7  False    False      False    True
8  False    False       True   False
9  False    False      False   False

In [48]:
df.isnull().sum()

EmpID        0
EmpName      1
EmpSalary    2
EmpAdd       3
dtype: int64

In [49]:
df.isnull().sum().sum()

np.int64(6)

In [54]:
newdf = df.dropna()   # remove missing values

In [52]:
newdf

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj    23440.0  Noida
1    102     Anu    67440.0  Delhi
5    106     Ram    56650.0  Delhi
9    110  Yogesh    38300.0  Delhi

In [55]:
newdf.EmpSalary

0    23440.0
1    67440.0
5    56650.0
9    38300.0
Name: EmpSalary, dtype: float64

In [56]:
newdf.EmpSalary.sum()

np.float64(185830.0)

In [57]:
df.EmpSalary

0    23440.0
1    67440.0
2        NaN
3    78756.0
4    34550.0
5    56650.0
6    32450.0
7    78970.0
8        NaN
9    38300.0
Name: EmpSalary, dtype: float64

In [58]:
df.EmpSalary.sum()

np.float64(410556.0)

In [60]:
newdf = df.fillna(value='Missing_Data')

In [61]:
newdf.shape

(10, 4)

In [62]:
newdf

   EmpID       EmpName     EmpSalary        EmpAdd
0    101           Raj       23440.0         Noida
1    102           Anu       67440.0         Delhi
2    103          Manu  Missing_Data           GZB
3    104          Siya       78756.0  Missing_Data
4    105  Missing_Data       34550.0         Noida
5    106           Ram       56650.0         Delhi
6    107         Shyam       32450.0  Missing_Data
7    108         Mohan       78970.0  Missing_Data
8    109          Ravi  Missing_Data         Noida
9    110        Yogesh       38300.0         Delhi

In [63]:
newdf.isnull().sum()

EmpID        0
EmpName      0
EmpSalary    0
EmpAdd       0
dtype: int64

In [64]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   EmpID      10 non-null     int64
 1   EmpName    10 non-null     object
 2   EmpSalary  10 non-null     object
 3   EmpAdd     10 non-null     object
dtypes: int64(1), object(3)
memory usage: 452.0+ bytes

In [65]:
newdf.EmpSalary

0         23440.0
1         67440.0
2    Missing_Data
3         78756.0
4         34550.0
5         56650.0
6         32450.0
7         78970.0
8    Missing_Data
9         38300.0
Name: EmpSalary, dtype: object

In [67]:
# newdf.EmpSalary.sum()
# now EmpSalary is an object column

In [68]:
df

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj    23440.0  Noida
1    102     Anu    67440.0  Delhi
2    103    Manu        NaN    GZB
3    104    Siya    78756.0    NaN
4    105     NaN    34550.0  Noida
5    106     Ram    56650.0  Delhi
6    107   Shyam    32450.0    NaN
7    108   Mohan    78970.0    NaN
8    109    Ravi        NaN  Noida
9    110  Yogesh    38300.0  Delhi

In [73]:
newdf = df.copy()

In [76]:
newdf.EmpSalary = newdf.EmpSalary.fillna(value = 0)

In [77]:
newdf

   EmpID EmpName  EmpSalary EmpAdd
0    101     Raj    23440.0  Noida
1    102     Anu    67440.0  Delhi
2    103    Manu        0.0    GZB
3    104    Siya    78756.0    NaN
4    105     NaN    34550.0  Noida
5    106     Ram    56650.0  Delhi
6    107   Shyam    32450.0    NaN
7    108   Mohan    78970.0    NaN
8    109    Ravi        0.0  Noida
9    110  Yogesh    38300.0  Delhi

In [78]:
newdf.isnull().sum()

EmpID        0
EmpName      1
EmpSalary    0
EmpAdd       3
dtype: int64

In [80]:
newdf = newdf.fillna(value='Unknown')

In [81]:
newdf

   EmpID  EmpName  EmpSalary   EmpAdd
0    101      Raj    23440.0    Noida
1    102      Anu    67440.0    Delhi
2    103     Manu        0.0      GZB
3    104     Siya    78756.0  Unknown
4    105  Unknown    34550.0    Noida
5    106      Ram    56650.0    Delhi
6    107    Shyam    32450.0  Unknown
7    108    Mohan    78970.0  Unknown
8    109     Ravi        0.0    Noida
9    110   Yogesh    38300.0    Delhi

In [82]:
newdf.isnull().sum()

EmpID        0
EmpName      0
EmpSalary    0
EmpAdd       0
dtype: int64

In [83]:
newdf.EmpSalary

0    23440.0
1    67440.0
2        0.0
3    78756.0
4    34550.0
5    56650.0
6    32450.0
7    78970.0
8        0.0
9    38300.0
Name: EmpSalary, dtype: float64

In [84]:
newdf.EmpSalary.sum()

np.float64(410556.0)